app/Controllers/Admin/CategoryController.php

SELECT *
FROM `categories`
WHERE `id` != '1'
---
    public function editForm($id)
    {
        $categoryModel = new CategoryModel();

        $category = $categoryModel->find($id);