app/Controllers/Admin/PostController.php

SELECT *
FROM `posts`
WHERE `posts`.`id` = '22'
SELECT *
FROM `categories`
SELECT *
FROM `tags`
---
    public function edit($id)
    {
        $postModel = new PostModel();
        $categoryModel = new CategoryModel();
        $tagModel = new TagModel();

        // 获取文章数据
        $post = $postModel->find($id);
        if (!$post) {
            session()->setFlashdata('error', '文章不存在');
            return redirect()->to('/admin/posts');
        }

        // 获取文章的标签
        $postTags = $this->getPostTags($id);

        // 准备视图数据
        $data = [
            'title' => '编辑文章 - 后台',
            'post' => $post,
            'categories' => $categoryModel->findAll(), // 所有分类
            'tags' => $tagModel->findAll(), // 所有标签

SELECT *
FROM `posts`
WHERE `posts`.`id` = '22'
---
    public function update($id)
    {
        $postModel = new PostModel();

        // 验证表单数据
        $rules = [
            'title' => 'required|min_length[3]|max_length[200]', // 标题必填，长度3-200
            'content' => 'required', // 内容必填
            'category_id' => 'required|is_natural_no_zero', // 分类必填，且为正整数
            'status' => 'required|in_list[draft,published,pending,scheduled]', // 状态必填，只能是draft、published、pending或scheduled
            'visibility' => 'required|in_list[public,private]', // 可见性必填，只能是public或private
        ];

        if (!$this->validate($rules)) {
            $errors = $this->validator->getErrors();
            session()->setFlashdata('errors', $errors);
            session()->setFlashdata('error', '表单验证失败，请检查以下字段：' . implode(', ', array_keys($errors)));
            return redirect()->back()->withInput();
        }

        // 获取现有文章数据
        $existingPost = $postModel->find($id);

SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `slug` = 'air-自动重启但新代码不生效'
AND `id` != '22'
---
    private function generateSlug($title, $excludeId = null)
    {
        $slug = url_title($title, '-', true);
        $postModel = new PostModel();

        // 检查slug是否已存在
        $counter = 1;
        $originalSlug = $slug;
        while (true) {
            $query = $postModel->where('slug', $slug);
            if ($excludeId) {
                $query->where('id !=', $excludeId);
            }
            if ($query->countAllResults() == 0) {

INSERT INTO `post_tags` (`created_at`, `post_id`, `tag_id`)
VALUES ('2026-04-17 15:50:30','22','9')
---
    private function savePostTags($postId, $tagIds)
    {
        $db = \Config\Database::connect();
        $data = [];
        foreach ($tagIds as $tagId) {
            $data[] = [
                'post_id' => $postId,
                'tag_id' => $tagId,
                'created_at' => date('Y-m-d H:i:s')
            ];
        }
        if (!empty($data)) {
            $db->table('post_tags')->insertBatch($data);

SELECT `tag_id`
FROM `post_tags`
WHERE `post_id` = '22'
---
    private function getPostTags($postId)
    {
        $db = \Config\Database::connect();
        $result = $db->table('post_tags')
            ->select('tag_id')
            ->where('post_id', $postId)
            ->get()
            ->getResultArray();

DELETE FROM `post_tags`
WHERE `post_id` = '22'
---
    private function updatePostTags($postId, $tagIds)
    {
        $db = \Config\Database::connect();
        // 删除旧的标签关联
        $db->table('post_tags')->where('post_id', $postId)->delete();