app/Controllers/Admin/TagController.php

    public function store()
    {
        $tagModel = new TagModel();

        // 验证表单数据
        $rules = [
            'name' => 'required|min_length[2]|max_length[50]|is_unique[tags.name]', // 名称必填，长度2-50，且唯一
            'slug' => 'required|min_length[2]|max_length[50]|is_unique[tags.slug]', // 别名必填，长度2-50，且唯一
        ];

        if (!$this->validate($rules)) {
            $errors = $this->validator->getErrors();
            $errorMessage = '验证失败：' . implode('；', $errors);
            session()->setFlashdata('error', $errorMessage);
            return redirect()->back()->withInput();
        }

        // 准备标签数据
        $tagData = [
            'name' => $this->request->getVar('name'), // 标签名称
            'slug' => $this->request->getVar('slug'), // 标签别名
            'description' => $this->request->getVar('description'), // 标签描述
        ];

        // 创建标签
        if (!$tagModel->insert($tagData)) {
---
INSERT INTO `tags` (`name`, `slug`, `description`, `created_at`, `updated_at`) VALUES ('Go', 'Go', NULL, '2026-03-27 10:52:40', '2026-03-27 10:52:40')