app/Controllers/Admin/UserController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $userModel = new UserModel();

        // 分页设置
        $perPage = 10; // 每页显示10条
        $page = $this->request->getVar('page') ?? 1; // 当前页码
        $offset = ($page - 1) * $perPage; // 偏移量

        // 获取用户列表
        $users = $userModel->getAllUsers($perPage, $offset);

        // 获取用户总数
        $totalUsers = $userModel->countAllResults();