app/Controllers/BlogController.php

    public function post($slug)
    {
        // 缓存键，使用slug的MD5值
        $cacheKey = 'post_' . md5($slug);
        $cache = \Config\Services::cache();

        // 尝试从缓存获取静态数据
        $staticData = $cache->get($cacheKey);

        // 获取实时数据
        $postModel = new PostModel();
        $post = $postModel->getPostBySlug($slug);

        if (!$post) {
            return redirect()->to('/')->with('error', '文章不存在');
        }

        // 增加浏览次数
        $postModel->incrementViews($post['id']);

        // 获取评论
        $commentModel = new CommentModel();
        $comments = $commentModel->getCommentsByPostId($post['id'], 'approved');

        // 获取相关文章（同分类）
        $relatedPosts = [];
        if ($post['category_id']) {
            $relatedPosts = $postModel->select('posts.*, categories.name as category_name, categories.slug as category_slug')
                ->join('categories', 'categories.id = posts.category_id', 'left')
                ->where('posts.category_id', $post['category_id'])
                ->where('posts.id !=', $post['id'])
                ->where('posts.status', 'published')
                ->where('posts.visibility', 'public')
                ->orderBy('posts.published_at', 'desc')
                ->limit(5)
                ->findAll();
---
SELECT `posts`.*, `categories`.`name` as `category_name`, `categories`.`slug` as `category_slug`
FROM `posts`
LEFT JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
WHERE `posts`.`category_id` = '1'
AND `posts`.`id` != '22'
AND `posts`.`status` = 'published'
AND `posts`.`visibility` = 'public'
ORDER BY `posts`.`published_at` DESC
 LIMIT 5