app/Controllers/Home.php

    public function index()
    {
        // 获取当前页码
        $page = $this->request->getGet('page') ?? 1;
        $page = max(1, (int) $page);

        // 每页显示的文章数量
        $perPage = 10;
        $offset = ($page - 1) * $perPage;

        // 缓存键，区分热门文章和普通文章
        $isPopular = $page == 1; // 首页第一页通常是热门文章
        $cacheKey = 'home_page_' . date('Ymd') . '_page_' . $page . ($isPopular ? '_popular' : '');
        $cache = \Config\Services::cache();

        // 尝试从缓存获取数据
        $cachedData = $cache->get($cacheKey);
        if ($cachedData) {
            return view('frontend/home', $cachedData);
        }

        // 初始化模型
        $postModel = new PostModel();
        $categoryModel = new CategoryModel();
        $tagModel = new TagModel();

        // 获取文章列表
        $posts = $postModel->getPublishedPosts($perPage, $offset);

        // 获取文章总数
        $totalPosts = \Config\Database::connect()->table('posts')
            ->where('status', 'published')
            ->where('visibility', 'public')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `status` = 'published'
AND `visibility` = 'public'

        $posts = $postModel->getPostsByCategory($category['id'], $perPage, $offset);

        // 获取文章总数
        $totalPosts = \Config\Database::connect()->table('posts')
            ->where('category_id', $category['id'])
            ->where('status', 'published')
            ->where('visibility', 'public')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `category_id` = '2'
AND `status` = 'published'
AND `visibility` = 'public'