app/Models/CategoryModel.php

    public function getAllCategories($limit = 100, $offset = 0)
    {
        return $this->select('categories.*, COALESCE(parent.name, \'\') as parent_name')
            ->join('categories as parent', 'parent.id = categories.parent_id', 'left')
            ->orderBy('categories.order', 'asc')
            ->orderBy('categories.created_at', 'desc')
            ->limit($limit, $offset)
            ->findAll();
---
SELECT `categories`.*, COALESCE(parent.name, '') as parent_name
FROM `categories`
LEFT JOIN `categories` as `parent` ON `parent`.`id` = `categories`.`parent_id`
ORDER BY `categories`.`order` ASC, `categories`.`created_at` DESC
 LIMIT 10

    public function getAllCategoriesCount()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `categories`

    public function getCategoryBySlug($slug)
    {
        return $this->where('slug', $slug)->first();
---
SELECT *
FROM `categories`
WHERE `slug` = 'life'
 LIMIT 1