app/Models/CommentModel.php

    public function getCommentsByPostId($postId, $status = 'approved')
    {
        $query = $this->select('comments.*, users.username, users.name as user_name, users.avatar')
            ->join('users', 'users.id = comments.user_id', 'left')
            ->where('comments.post_id', $postId);

        if ($status) {
            $query->where('comments.status', $status);
        }

        return $query->orderBy('comments.created_at', 'asc')
            ->findAll();
---
SELECT `comments`.*, `users`.`username`, `users`.`name` as `user_name`, `users`.`avatar`
FROM `comments`
LEFT JOIN `users` ON `users`.`id` = `comments`.`user_id`
WHERE `comments`.`post_id` = '22'
AND `comments`.`status` = 'approved'
ORDER BY `comments`.`created_at` ASC