app/Models/LinkModel.php

SELECT *
FROM `links`
WHERE `status` = 'active'
---
    public function getActiveLinks()
    {
        return $this->where('status', 'active')->findAll();