app/Models/PostModel.php

    public function getPublishedPosts($limit = 10, $offset = 0, $order_by = null, $order = null)
    {
        $builder = $this->select('posts.*, users.username, users.name as author_name, categories.name as category_name, categories.slug as category_slug, categories.icon as category_icon')
            ->join('users', 'users.id = posts.user_id', 'left')
            ->join('categories', 'categories.id = posts.category_id', 'left')
            ->where('posts.status', 'published')
            ->where('posts.visibility', 'public')
            ->orderBy('posts.published_at', 'desc');
        if ($order_by && $order) {
            $builder->orderBy($order_by, $order);
        }
        return $builder->limit($limit, $offset)
            ->findAll();
---
SELECT `posts`.*, `users`.`username`, `users`.`name` as `author_name`, `categories`.`name` as `category_name`, `categories`.`slug` as `category_slug`, `categories`.`icon` as `category_icon`
FROM `posts`
LEFT JOIN `users` ON `users`.`id` = `posts`.`user_id`
LEFT JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
WHERE `posts`.`status` = 'published'
AND `posts`.`visibility` = 'public'
ORDER BY `posts`.`published_at` DESC
 LIMIT 10

    public function getPostBySlug($slug)
    {
        return $this->select('posts.*, users.username, users.name as author_name, categories.name as category_name, categories.slug as category_slug, categories.icon as category_icon')
            ->join('users', 'users.id = posts.user_id', 'left')
            ->join('categories', 'categories.id = posts.category_id', 'left')
            ->where('posts.slug', $slug)
            ->where('posts.status', 'published')
            ->where('posts.visibility', 'public')
            ->first();
---
SELECT `posts`.*, `users`.`username`, `users`.`name` as `author_name`, `categories`.`name` as `category_name`, `categories`.`slug` as `category_slug`, `categories`.`icon` as `category_icon`
FROM `posts`
LEFT JOIN `users` ON `users`.`id` = `posts`.`user_id`
LEFT JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
WHERE `posts`.`slug` = 'air-自动重启但新代码不生效'
AND `posts`.`status` = 'published'
AND `posts`.`visibility` = 'public'
 LIMIT 1

    public function getPostsByCategory($categoryId, $limit = 10, $offset = 0)
    {
        return $this->select('posts.*, users.username, users.name as author_name, categories.name as category_name, categories.slug as category_slug, categories.icon as category_icon')
            ->join('users', 'users.id = posts.user_id', 'left')
            ->join('categories', 'categories.id = posts.category_id', 'left')
            ->where('posts.category_id', $categoryId)
            ->where('posts.status', 'published')
            ->where('posts.visibility', 'public')
            ->orderBy('posts.published_at', 'desc')
            ->limit($limit, $offset)
            ->findAll();
---
SELECT `posts`.*, `users`.`username`, `users`.`name` as `author_name`, `categories`.`name` as `category_name`, `categories`.`slug` as `category_slug`, `categories`.`icon` as `category_icon`
FROM `posts`
LEFT JOIN `users` ON `users`.`id` = `posts`.`user_id`
LEFT JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
WHERE `posts`.`category_id` = '2'
AND `posts`.`status` = 'published'
AND `posts`.`visibility` = 'public'
ORDER BY `posts`.`published_at` DESC
 LIMIT 10

    public function incrementViews($postId)
    {
        // 检查文章是否存在
        if (!$this->find($postId)) {
            return false;
        }

        try {
            // 使用CodeIgniter的查询构建器，更安全
            $this->where('id', $postId)
                ->set('views', 'views + 1', false) // false表示不转义，允许SQL表达式
                ->update();
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '22'
UPDATE `posts` SET `views` = views + 1, `updated_at` = '2026-04-17 15:51:13'
WHERE `id` = '22'

    public function getAllPostsCount($search = null, $status = null, $categoryId = null)
    {
        $builder = $this->select('posts.*')
            ->join('users', 'users.id = posts.user_id', 'left')
            ->join('categories', 'categories.id = posts.category_id', 'left');

        // 添加搜索条件
        if (!empty($search)) {
            $builder->groupStart()
                ->like('posts.title', $search)
                ->orLike('posts.content', $search)
                ->orLike('users.username', $search)
                ->orLike('categories.name', $search)
                ->groupEnd();
        }

        // 添加状态筛选
        if (!empty($status)) {
            $builder->where('posts.status', $status);
        }

        // 添加分类筛选
        if (!empty($categoryId)) {
            $builder->where('posts.category_id', $categoryId);
        }

        return $builder->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `posts`
LEFT JOIN `users` ON `users`.`id` = `posts`.`user_id`
LEFT JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
WHERE   (
`posts`.`title` LIKE '%但新代码不生效%' ESCAPE '!'
OR  `posts`.`content` LIKE '%但新代码不生效%' ESCAPE '!'
OR  `users`.`username` LIKE '%但新代码不生效%' ESCAPE '!'
OR  `categories`.`name` LIKE '%但新代码不生效%' ESCAPE '!'
 )