app/Models/PostRevisionModel.php

SELECT *
FROM `post_revisions`
WHERE `post_id` = 22
ORDER BY `version` DESC
 LIMIT 1
UPDATE `post_revisions` SET `is_current` = 0
WHERE `post_id` = 22
---
    public function createRevision(int $postId, array $postData, string $changeSummary = '', int $userId = null)
    {
        // 获取当前最新版本号
        $latestVersion = $this->where('post_id', $postId)
            ->orderBy('version', 'DESC')
            ->first();

        $newVersion = $latestVersion ? $latestVersion['version'] + 1 : 1;

        // 将所有旧版本的is_current设为0
        $this->where('post_id', $postId)
            ->set('is_current', 0)
            ->update();

SELECT COUNT(*) AS `numrows`
FROM `post_revisions`
WHERE `post_id` = 22
---
    private function cleanupOldRevisions(int $postId): void
    {
        $totalRevisions = $this->where('post_id', $postId)->countAllResults();