app/Models/PostModel.php

SELECT COUNT(*) AS `numrows`
FROM `posts`
LEFT JOIN `users` ON `users`.`id` = `posts`.`user_id`
LEFT JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
---
    public function getAllPostsCount($search = null, $status = null, $categoryId = null)
    {
        $builder = $this->select('posts.*')
            ->join('users', 'users.id = posts.user_id', 'left')
            ->join('categories', 'categories.id = posts.category_id', 'left');

        // 添加搜索条件
        if (!empty($search)) {
            $builder->groupStart()
                ->like('posts.title', $search)
                ->orLike('posts.content', $search)
                ->orLike('users.username', $search)
                ->orLike('categories.name', $search)
                ->groupEnd();
        }

        // 添加状态筛选
        if (!empty($status)) {
            $builder->where('posts.status', $status);
        }

        // 添加分类筛选
        if (!empty($categoryId)) {
            $builder->where('posts.category_id', $categoryId);
        }

        return $builder->countAllResults();