app/Models/SettingModel.php

    public function getValue($key, $default = null)
    {
        $setting = $this->where('setting_key', $key)->first();
---
SELECT *
FROM `settings`
WHERE `setting_key` = 'about_title'
 LIMIT 1