app/Models/TagModel.php

    public function getAllTags($limit = 10, $offset = 0)
    {
        return $this->orderBy('posts_count', 'desc')
            ->orderBy('created_at', 'desc')
            ->limit($limit, $offset)
            ->findAll();
---
SELECT *
FROM `tags`
ORDER BY `posts_count` DESC, `created_at` DESC
 LIMIT 10

    public function getAllTagsCount()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tags`