app/Models/UserModel.php

SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 10
---
    public function getAllUsers($limit = 10, $offset = 0)
    {
        return $this->orderBy('created_at', 'desc')
            ->limit($limit, $offset)
            ->findAll();